app/views/characters/show.html.erb

SELECT "game_assets".* FROM "game_assets" WHERE "game_assets"."character_id" = 1 LIMIT 1
---
		<tr>
			<% @character.game_assets.each do |c| %>

SELECT "game_expenses".* FROM "game_expenses" WHERE "game_expenses"."character_id" = 1
---
		<tr>
			<% @character.game_expenses.each do |c| %>