app/controllers/characters_controller.rb

  def show
    character_assets = Character.new
    @total_a=character_assets.sum_a(params[:id])
    @total_d=character_assets.sum_d(params[:id])

    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @character = Character.new(params[:character])

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 12 Jan 2012 19:00:52 UTC +00:00], ["name", "Killstorem"], ["updated_at", Thu, 12 Jan 2012 19:00:52 UTC +00:00]]

  def update
    @character = Character.find(params[:id])

    respond_to do |format|
      if @character.update_attributes(params[:character])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "characters" SET "name" = 'Killstorem2', "updated_at" = '2012-01-13 02:32:41.798300' WHERE "characters"."id" = 1

  def destroy
    @character = Character.find(params[:id])
    @character.destroy
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 4]]