app/controllers/game_expenses_controller.rb

SELECT "game_expenses".* FROM "game_expenses"
---
  def index
    @game_expenses = GameExpense.all

SELECT "game_expenses".* FROM "game_expenses" WHERE "game_expenses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @game_expense = GameExpense.find(params[:id])

SELECT "game_expenses".* FROM "game_expenses" WHERE "game_expenses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @game_expense = GameExpense.find(params[:id])

INSERT INTO "game_expenses" ("character_id", "created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["character_id", 5], ["created_at", Fri, 13 Jan 2012 03:29:34 UTC +00:00], ["name", "what??"], ["price", 5], ["updated_at", Fri, 13 Jan 2012 03:29:34 UTC +00:00]]
---
  def create
    @game_expense = GameExpense.new(params[:game_expense])

    respond_to do |format|
      if @game_expense.save

SELECT "game_expenses".* FROM "game_expenses" WHERE "game_expenses"."id" = ? LIMIT 1  [["id", "8"]]
---
  def update
    @game_expense = GameExpense.find(params[:id])

SELECT "game_expenses".* FROM "game_expenses" WHERE "game_expenses"."id" = ? LIMIT 1  [["id", "9"]]
DELETE FROM "game_expenses" WHERE "game_expenses"."id" = ?  [["id", 9]]
---
  def destroy
    @game_expense = GameExpense.find(params[:id])
    @game_expense.destroy