app/controllers/game_assets_controller.rb

  def index
    @game_assets = GameAsset.all
---
SELECT "game_assets".* FROM "game_assets"

  def show
    @game_asset = GameAsset.find(params[:id])
---
SELECT "game_assets".* FROM "game_assets" WHERE "game_assets"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @game_asset = GameAsset.find(params[:id])
---
SELECT "game_assets".* FROM "game_assets" WHERE "game_assets"."id" = ? LIMIT 1  [["id", "1"]]

  def create
     @game_asset = GameAsset.new(params[:game_asset])

    respond_to do |format|
      if @game_asset.save
---
INSERT INTO "game_assets" ("character_id", "created_at", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["character_id", 1], ["created_at", Thu, 12 Jan 2012 19:18:25 UTC +00:00], ["name", "Bigest gun"], ["price", 10000], ["updated_at", Thu, 12 Jan 2012 19:18:25 UTC +00:00]]

  def update
    @game_asset = GameAsset.find(params[:id])

    respond_to do |format|
      if @game_asset.update_attributes(params[:game_asset])
---
SELECT "game_assets".* FROM "game_assets" WHERE "game_assets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "game_assets" SET "name" = 'Guner', "price" = 5000, "player_id" = 2, "updated_at" = '2012-01-12 18:40:33.006900' WHERE "game_assets"."id" = 1

  def destroy
    @game_asset = GameAsset.find(params[:id])
    @game_asset.destroy
---
SELECT "game_assets".* FROM "game_assets" WHERE "game_assets"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "game_assets" WHERE "game_assets"."id" = ?  [["id", 2]]

  def total
    player = GameAsset.new
    @total=player.sum
---
SELECT "game_assets".* FROM "game_assets" LIMIT 1