app/controllers/game_assets_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = 1 LIMIT 1
---
  def destroy
    @game_asset = GameAsset.find(params[:id])
    @character = Character.find(@game_asset.character_id)