app/controllers/game_expenses_controller.rb

SELECT "characters".* FROM "characters" WHERE "characters"."id" = 1 LIMIT 1
---
  def destroy
    @game_expense = GameExpense.find(params[:id])
    @character = Character.find(@game_expense.character_id)