app/controllers/players_controller.rb

  def show
    @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 12 Jan 2012 16:24:45 UTC +00:00], ["name", "eden 001"], ["updated_at", Thu, 12 Jan 2012 16:24:45 UTC +00:00]]